# Week 2 Tutorial Lab Session

### Introduction to Python for Data Science

#### Loading Libraries and creating simple data frames

In [17]:
import pandas

In [18]:
dataframe = pandas.DataFrame({
            'StudentID' : [264422,264423,264444,264445,264446],
            'FirstName' : ['Steven','Alex','Bill','Mark','Bob'],
            'EnrolYear' : [2010,2010,2011,2011,2013],
            'Math'      : [100,90,90,40,60],
            'English'   : [60,70,80,80,60]
            })

In [19]:
dataframe

   StudentID FirstName  EnrolYear  Math  English
0     264422    Steven       2010   100       60
1     264423      Alex       2010    90       70
2     264444      Bill       2011    90       80
3     264445      Mark       2011    40       80
4     264446       Bob       2013    60       60

In [20]:
dataHeight = pandas.DataFrame({'Height': [160, 155, 175, 175], 
                               'Student' : [264422, 264423, 264444, 264445]})

In [21]:
dataHeight

   Height  Student
0     160   264422
1     155   264423
2     175   264444
3     175   264445

### Column and row selection

In [22]:
dataHeight['Height']

0    160
1    155
2    175
3    175
Name: Height, dtype: int64

In [23]:
dataHeight['Height'] > 170

0    False
1    False
2     True
3     True
Name: Height, dtype: bool

In [24]:
dataHeight[dataHeight['Height'] > 170]

   Height  Student
2     175   264444
3     175   264445

### Something that seems fine to do but it is not fine

In [25]:
dataHeight[True]

KeyError: True

In [26]:
dataframe['Total'] = dataframe['Math'] + dataframe['English']

In [27]:
dataframe

   StudentID FirstName  EnrolYear  Math  English  Total
0     264422    Steven       2010   100       60    160
1     264423      Alex       2010    90       70    160
2     264444      Bill       2011    90       80    170
3     264445      Mark       2011    40       80    120
4     264446       Bob       2013    60       60    120

In [28]:
dataframe = pandas.melt(
dataframe,
id_vars=['EnrolYear','FirstName','StudentID'],
value_vars=['Math','English'],
var_name='Subject', value_name = "Not value")

In [29]:
dataframe

   EnrolYear FirstName  StudentID  Subject  Not value
0       2010    Steven     264422     Math        100
1       2010      Alex     264423     Math         90
2       2011      Bill     264444     Math         90
3       2011      Mark     264445     Math         40
4       2013       Bob     264446     Math         60
5       2010    Steven     264422  English         60
6       2010      Alex     264423  English         70
7       2011      Bill     264444  English         80
8       2011      Mark     264445  English         80
9       2013       Bob     264446  English         60

In [37]:
dataframe = pandas.melt(dataframe, 
                        id_vars = ['StudentID', 'FirstName', 'EnrolYear'], 
                        value_vars = ['Not value'], var_name = ['Not not value'], 
                        value_name = 'tits')

D:\Anaconda\lib\site-packages\IPython\core\interactiveshell.py:3418: FutureWarning: This dataframe has a column name that matches the 'value_name' column name of the resultiing Dataframe. In the future this will raise an error, please set the 'value_name' parameter of DataFrame.melt to a unique name.
  exec(code_obj, self.user_global_ns, self.user_ns)

KeyError: "The following 'value_vars' are not present in the DataFrame: ['Not value']"

In [36]:
dataframe

   StudentID FirstName  EnrolYear Not not value  tits
0     264422    Steven       2010     Not value   100
1     264423      Alex       2010     Not value    90
2     264444      Bill       2011     Not value    90
3     264445      Mark       2011     Not value    40
4     264446       Bob       2013     Not value    60
5     264422    Steven       2010     Not value    60
6     264423      Alex       2010     Not value    70
7     264444      Bill       2011     Not value    80
8     264445      Mark       2011     Not value    80
9     264446       Bob       2013     Not value    60